# Temperature Population Sea Level and Emissions
### Notebook to combine .csv datasets into one sqlite database for Project 2

In [9]:
# Dependencies and Setup
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

# File to Load  
temperature_data_to_load = "data/temp_data.csv"
population_data_to_load = "data/population_data.csv"
sealevel_data_to_load = "data/sealevel_data.csv"
co2_data_to_load = "data/co2_ppm.csv"
datestamp_data_to_load = "data/datestamp.csv"

# Read Data  
temperature_data = pd.read_csv(temperature_data_to_load)
population_data = pd.read_csv(population_data_to_load)
sealevel_data = pd.read_csv(sealevel_data_to_load)
co2_data = pd.read_csv(co2_data_to_load)
datestamp_data = pd.read_csv(datestamp_data_to_load)

In [10]:
#Temp Data Molly C.
temperature_data.head(5)

   Year  LandAndOceanAverageTemperature  LandAndOceanAverageTemperatureUncertainty
0  1993                       15.466417                                   0.059167
1  1994                       15.535000                                   0.058583
2  1995                       15.637833                                   0.060417
3  1996                       15.524667                                   0.059500
4  1997                       15.713833                                   0.059167

In [11]:
#Population Data John B. 
population_data.head(5)

   Unnamed: 0  Year  population_millions
0           0  1993          5581597.598
1           1  1994          5663150.428
2           2  1995          5744212.930
3           3  1996          5824891.931
4           4  1997          5905045.647

In [12]:
#Sealevel Data Melissa W. 
sealevel_data.head(5)

   Year       GMSL
0  1993  90.471622
1  1994  89.516216
2  1995  87.334722
3  1996  85.473243
4  1997  99.442432

In [13]:
#C02 Data - Kat A. 
co2_data.head(5)

   Year  CO2_concentration_per_million
0  1993                         357.10
1  1994                         358.83
2  1995                         360.82
3  1996                         362.61
4  1997                         363.73

In [14]:
#DateStamp Data for Prophet Melissa
datestamp_data.head(5)

   Year        DS
0  1993  1/1/1993
1  1994  1/1/1994
2  1995  1/1/1995
3  1996  1/1/1996
4  1997  1/1/1997

In [15]:
# temperature_data = pd.read_csv(temperature_data_to_load)
# population_data = pd.read_csv(population_data_to_load)
# sealevel_data = pd.read_csv(sealevel_data_to_load)
# co2_data = pd.read_csv(co2_data_to_load)
merge_table = pd.merge(temperature_data, population_data, on="Year", how="left")
merge_table_2 = pd.merge(merge_table, sealevel_data, on="Year", how="left")
merge_table_3 = pd.merge(merge_table_2, co2_data, on="Year", how="left")
merge_table_4 = pd.merge(merge_table_3, datestamp_data, on="Year", how="left")

In [21]:
merge_table_4

    Year  LandAndOceanAverageTemperature  LandAndOceanAverageTemperatureUncertainty  Unnamed: 0  population_millions        GMSL  CO2_concentration_per_million        DS
0   1993                       15.466417                                   0.059167           0          5581597.598   90.471622                         357.10  1/1/1993
1   1994                       15.535000                                   0.058583           1          5663150.428   89.516216                         358.83  1/1/1994
2   1995                       15.637833                                   0.060417           2          5744212.930   87.334722                         360.82  1/1/1995
3   1996                       15.524667                                   0.059500           3          5824891.931   85.473243                         362.61  1/1/1996
4   1997                       15.713833                                   0.059167           4          5905045.647   99.442432                         363.73  1/1/1997
5   1998                       15.826000                                   0.063000           5          5984794.075   96.977297                         366.70  1/1/1998
6   1999                       15.600333                                   0.063333           6          6064239.033   87.769459                         368.38  1/1/1999
7   2000                       15.610667                                   0.063500           7          6143493.806   86.657297                         369.55  1/1/2000
8   2001                       15.767500                                   0.064583           8          6222626.531   84.688378                         371.14  1/1/2001
9   2002                       15.829167                                   0.062917           9          6301773.172   85.895278                         373.28  1/1/2002
10  2003                       15.826583                                   0.064333          10          6381185.141   87.178919                         375.80  1/1/2003
11  2004                       15.757250                                   0.061250          11          6461159.391   86.263784                         377.52  1/1/2004
12  2005                       15.879250                                   0.060833          12          6541906.956   85.427838                         379.80  1/1/2005
13  2006                       15.813500                                   0.061000          13          6623517.917   86.161389                         381.90  1/1/2006
14  2007                       15.827333                                   0.059083          14          6705946.643   85.265946                         383.79  1/1/2007
15  2008                       15.721250                                   0.057250          15          6789088.672   86.838889                         385.60  1/1/2008
16  2009                       15.827167                                   0.058917          16          6872766.988   85.634054                         387.43  1/1/2009
17  2010                       15.895500                                   0.058583          17          6956823.588   87.830811                         389.90  1/1/2010
18  2011                       15.769500                                   0.059000          18          7041194.168   89.016757                         391.65  1/1/2011
19  2012                       15.802333                                   0.061500          19          7125827.957   87.514324                         393.85  1/1/2012
20  2013                       15.854417                                   0.064667          20          7210582.041   87.777297                         396.52  1/1/2013
21  2014                       15.913000                                   0.063167          21          7295290.759   88.426667                         398.65  1/1/2014
22  2015                       16.058583                                   0.060833          22          7379796.967  100.599189                         400.83  1/1/2015

In [32]:
climate_combined_1 = merge_table_4.drop(["Unnamed: 0"], axis = 1)
climate_combined_1

    Year  LandAndOceanAverageTemperature  LandAndOceanAverageTemperatureUncertainty  population_millions        GMSL  CO2_concentration_per_million        DS
0   1993                       15.466417                                   0.059167          5581597.598   90.471622                         357.10  1/1/1993
1   1994                       15.535000                                   0.058583          5663150.428   89.516216                         358.83  1/1/1994
2   1995                       15.637833                                   0.060417          5744212.930   87.334722                         360.82  1/1/1995
3   1996                       15.524667                                   0.059500          5824891.931   85.473243                         362.61  1/1/1996
4   1997                       15.713833                                   0.059167          5905045.647   99.442432                         363.73  1/1/1997
5   1998                       15.826000                                   0.063000          5984794.075   96.977297                         366.70  1/1/1998
6   1999                       15.600333                                   0.063333          6064239.033   87.769459                         368.38  1/1/1999
7   2000                       15.610667                                   0.063500          6143493.806   86.657297                         369.55  1/1/2000
8   2001                       15.767500                                   0.064583          6222626.531   84.688378                         371.14  1/1/2001
9   2002                       15.829167                                   0.062917          6301773.172   85.895278                         373.28  1/1/2002
10  2003                       15.826583                                   0.064333          6381185.141   87.178919                         375.80  1/1/2003
11  2004                       15.757250                                   0.061250          6461159.391   86.263784                         377.52  1/1/2004
12  2005                       15.879250                                   0.060833          6541906.956   85.427838                         379.80  1/1/2005
13  2006                       15.813500                                   0.061000          6623517.917   86.161389                         381.90  1/1/2006
14  2007                       15.827333                                   0.059083          6705946.643   85.265946                         383.79  1/1/2007
15  2008                       15.721250                                   0.057250          6789088.672   86.838889                         385.60  1/1/2008
16  2009                       15.827167                                   0.058917          6872766.988   85.634054                         387.43  1/1/2009
17  2010                       15.895500                                   0.058583          6956823.588   87.830811                         389.90  1/1/2010
18  2011                       15.769500                                   0.059000          7041194.168   89.016757                         391.65  1/1/2011
19  2012                       15.802333                                   0.061500          7125827.957   87.514324                         393.85  1/1/2012
20  2013                       15.854417                                   0.064667          7210582.041   87.777297                         396.52  1/1/2013
21  2014                       15.913000                                   0.063167          7295290.759   88.426667                         398.65  1/1/2014
22  2015                       16.058583                                   0.060833          7379796.967  100.599189                         400.83  1/1/2015

In [33]:
#Save it all into one file
climate_combined_1.to_csv('data/combinedclimatedata_prophet.csv')